InformationRegisters/ДлительныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_файла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФайлаВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имитация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяДействияДляФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменитьДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДлительныеДействияЭтап.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействияЭтап</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МиллисекундыОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеЭтапаДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Миллисекунды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омДлительныеОперцииНаСервере/Ext/Module.bsl
#Область СозданиеРеквизитовФормы

Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма,РодительскийЭлемент) Экспорт
	
	ЭлементГруппа = СоздатьГруппуДлительныеОперации(ТекущаяФорма, РодительскийЭлемент);
	СоздадьКомандуПоказатьДлительныеДействия(ТекущаяФорма);
	СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа);
	
	ИмяРеквизита = СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма);
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа);	
	
КонецПроцедуры 

Функция СоздадьКомандуПоказатьДлительныеДействия(ТекущаяФорма)
	
	КомандаДобавитьКомментарий 				= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаДлительныеДействия");
	КомандаДобавитьКомментарий.Заголовок 	= "Показать действия";
	КомандаДобавитьКомментарий.Действие 	= "ОбщаяКомандаДлительныеДействия";
	
	Возврат КомандаДобавитьКомментарий;
	
КонецФункции

Процедура СоздатьКнопкуДобавитьКомментарий(ТекущаяФорма, ЭлементГруппа)
	
	КнопкаДобавитьКомментарий 				= ТекущаяФорма.Элементы.Добавить("КнопкаПоказатьДлительныеДействия", Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКомментарий.Заголовок 	= "Показать действия";
	КнопкаДобавитьКомментарий.ИмяКоманды 	= "ОбщаяКомандаДлительныеДействия";
	
КонецПроцедуры

Функция СоздатьГруппуДлительныеОперации(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаДлительныеДействия_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКомментарий;
	
КонецФункции

Процедура СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа)
	
	НовыйЭлемент 				= ТекущаяФорма.Элементы.Добавить("ДлительныеДействия_авто", Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок		= "Длительные действия";
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеHTMLДокумента;
	НовыйЭлемент.ПутьКДанным 	= ИмяРеквизита;
	НовыйЭлемент.Видимость		= Ложь;
	
КонецПроцедуры // СоздатьЭлементФормы(ТекущаяФорма)

Функция СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

	имяРеквизита = "ДлительныеДействия_авто";
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат имяРеквизита;
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

#КонецОбласти

Функция Получить_HTML_длительное_действие(Знач ОбъектДействия) Экспорт
	
	
	ТипОбъекта = ТипЗнч(ОбъектДействия);
	
	Если Тип("ЗадачаСсылка.Задачи_ПКД") = ТипОбъекта ИЛИ Тип("ЗадачаСсылка.Задачи_РКД") = ТипОбъекта Тогда
	
		ОбъектДействия = ОбъектДействия.ОбъектТЗ;	
	
	КонецЕсли;

	стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML("", 4);
	
	стрВозврата = стрВозврата + "<table>";
	стрВозврата = стрВозврата + "<tr><th style=""min-width: 70px;"">Дата</th><th>Действие</th><th style=""min-width: 65px;"">Автор</th><th style=""min-width: 15px;"">Ошибка</th></tr>";
	
	ШаблонСтроки = "<tr style=""color: %1;""><td>%2</td><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.АвторДействия КАК Автор,
		|	ДлительныеДействия.ДействиеЗавершено КАК ДействиеЗавершено,
		|	ДлительныеДействияЭтап.Миллисекунды КАК Миллисекунды,
		|	ДлительныеДействияЭтап.Завершен КАК Завершен,
		|	ДлительныеДействияЭтап.МиллисекундыОкончания КАК МиллисекундыОкончания,
		|	ДлительныеДействияЭтап.ОписаниеЭтапаДействия КАК ОписаниеЭтапаДействия,
		|	ДлительныеДействияЭтап.ВыполненоСОшибкой КАК ВыполненоСОшибкой
		|ИЗ
		|	РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДлительныеДействияЭтап КАК ДлительныеДействияЭтап
		|		ПО ДлительныеДействия.УИДДействия = ДлительныеДействияЭтап.УИДДействия
		|ГДЕ
		|	ДлительныеДействия.ОбъектДействия = &ОбъектДействия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Миллисекунды УБЫВ";
	
	
	Запрос.УстановитьПараметр("ОбъектДействия", ОбъектДействия);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТестСообщения = СтрЗаменить(Выборка.ОписаниеЭтапаДействия, "&", "&amp;");
		ТестСообщения = СтрЗаменить(ТестСообщения, ">",  "&gt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "<",  "&lt;");
		ТестСообщения = СтрЗаменить(ТестСообщения, """", "&quot;");
		ТестСообщения = СтрЗаменить(ТестСообщения, "'",  "&apos;");
		стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, ?(Выборка.ДействиеЗавершено, "black", "blue"),
															Формат(МиллисикундыВДату(Выборка.Миллисекунды), "ДЛФ=DT"),
															ТестСообщения, 
															Выборка.Автор,
															?(Выборка.ВыполненоСОшибкой, "V", ""));	
	КонецЦикла;
	
	стрВозврата = стрВозврата + "</table>";
	
	стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	
	Возврат стрВозврата;

КонецФункции // Получить_HTML_длительное_действие()

Функция МиллисикундыВДату(ЧислоМиллисекунд) Экспорт

	Возврат Дата(1, 1, 1, 3, 0, 0) + Цел(ЧислоМиллисекунд / 1000);	//Московское время

КонецФункции // МилисикундыВДату()

Функция ВывестиДлителноеДействиеНаФорму(ТекущаяФорма) Экспорт
	
	ТекущаяФорма.Элементы.ДлительныеДействия_авто.Видимость = Истина;
	ТекущаяФорма.Элементы.КнопкаПоказатьДлительныеДействия.Заголовок = "Скрыть действия";
	ТекущаяФорма.ДлительныеДействия_авто = омДлительныеОперцииНаСервере.Получить_HTML_длительное_действие(ТекущаяФорма.Объект.Ссылка);
	
КонецФункции // ВывестиДлителноеДействиеНаФорму()

Процедура ДлительноеДействие(УИДДействия, ЗадачаСсылка, НаименованиеДействия) Экспорт
	
	ДанныеЗадачи = ПолучитьДанныеЗадачи(ЗадачаСсылка);
	
    Если НаименованиеДействия = "СбросКонструктором" ИЛИ НаименованиеДействия = "ЗавершениеРаботы" Тогда
		
		Если Не КонтрольЗаблокированныхФайлов(УИДДействия, ДанныеЗадачи) Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ИзменениеПравPDM(УИДДействия, ДанныеЗадачи, Ложь) Тогда
			Возврат;
		КонецЕсли;

		омФайлыPDM.ЗавершитьДействие(УИДДействия, ДанныеЗадачи.ОбъектТЗ);
		омФайлыPDM.ВыполнитьДействиеЗадачи(УИДДействия)
		
	ИначеЕсли НаименованиеДействия = "НачатьВыполнение"Тогда
		
		Если Не ИзменениеПравPDM(УИДДействия, ДанныеЗадачи, Истина) Тогда
			Возврат;
		КонецЕсли;

		омФайлыPDM.ЗавершитьДействие(УИДДействия, ДанныеЗадачи.ОбъектТЗ);
		омФайлыPDM.ВыполнитьДействиеЗадачи(УИДДействия)
	
	КонецЕсли;
	
КонецПроцедуры    

Функция ИзменениеПравPDM(УИДДействия, ДанныеЗадачи ,УстановитьПрава)
	
	Если ДанныеЗадачи.ЭтоКомпозиция Тогда
		Если омФайлыPDM.ИзменитьПраваКомпозиции(УИДДействия, ДанныеЗадачи.ОбъектТЗ, УстановитьПрава, ДанныеЗадачи.ОбъектТЗНаименование) Тогда
			Для каждого ДанныеКомплекта Из омКомпозиции.ПолучитьКомплектыКомпозиции(ДанныеЗадачи.ОбъектТЗ).ДанныеКомплектов Цикл
				Если НЕ омФайлыPDM.ИзменитьПраваКомплекту(УИДДействия, ДанныеКомплекта.Комплект, УстановитьПрава, ДанныеКомплекта.Наименование) Тогда
					Возврат Ложь;
				КонецЕсли;	
			КонецЦикла; 
			
			Возврат Истина;
		Иначе	
			Возврат Ложь;	
		КонецЕсли;
	Иначе
		Возврат омФайлыPDM.ИзменитьПраваКомплекту(УИДДействия, ДанныеЗадачи.ОбъектТЗ, УстановитьПрава, ДанныеЗадачи.ОбъектТЗНаименование); 
	КонецЕсли;
	
	
КонецФункции // ИзменениеПравPDM()

Функция КонтрольЗаблокированныхФайлов(УИДДействия, ДанныеЗадачи)
	
	Миллисекунды = омФайлыPDM.СоздатьЭтап(УИДДействия, "Контроль разрегестрированных файлов " + ДанныеЗадачи.ОбъектТЗНаименование);
	
	ГлубинаПросмотра = ?(ДанныеЗадачи.ЭтоКомпозиция, 1, 2); 
	ДанныеРазбора = омФайлыPDM.ПолучитьДанныеИзXML(омФайлыPDM.ИнформацияОЗаблокированныхPDM(ДанныеЗадачи.ОбъектТЗ, ГлубинаПросмотра), "ПутиКФайлам");  
	
	Если НЕ ПустаяСтрока(ДанныеРазбора.ОписаниеОшибки) Тогда
		омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, ДанныеРазбора.ОписаниеОшибки);
		Возврат Ложь;
	ИначеЕсли ДанныеРазбора.Параметр.Количество() > 0 Тогда
		омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, "Есть разрегестрированные файлы (" + ДанныеРазбора.Параметр.Количество() + ") " +  ДанныеЗадачи.ОбъектТЗНаименование);
		Возврат Ложь;
	КонецЕсли;
	
	омФайлыPDM.ЗавершитьЭтап(УИДДействия, Миллисекунды); 
	
	Если ДанныеЗадачи.ЭтоКомпозиция Тогда
		
		Для каждого ДанныеКомплекта Из омКомпозиции.ПолучитьКомплектыКомпозиции(ДанныеЗадачи.ОбъектТЗ).ДанныеКомплектов Цикл
			
			Миллисекунды = омФайлыPDM.СоздатьЭтап(УИДДействия, "Контроль разрегестрированных файлов " + ДанныеКомплекта.Наименование);
			
			Если ДанныеКомплекта.Код_в_PDM = 0 Тогда
				омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, СтрШаблон("У комплекта %1 не заполнен код PDM", ДанныеКомплекта.Наименование));
			КонецЕсли;	
			
			ДанныеРазбора = омФайлыPDM.ПолучитьДанныеИзXML(омФайлыPDM.ИнформацияОЗаблокированныхPDM(ДанныеКомплекта.Код_в_PDM, 2), "ПутиКФайлам");  
			
			Если НЕ ПустаяСтрока(ДанныеРазбора.ОписаниеОшибки) Тогда
				омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, ДанныеРазбора.ОписаниеОшибки);
				Возврат Ложь;
			ИначеЕсли ДанныеРазбора.Параметр.Количество() > 0 Тогда
				омФайлыPDM.ЗавершитьЭтапсОшибкой(УИДДействия, Миллисекунды, "Есть разрегестрированные файлы (" + ДанныеРазбора.Параметр.Количество() + ") у комплекта " + ДанныеКомплекта.Наименование);
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // КонтрольЗаблокированныхФайлов() 

Функция ПолучитьДанныеЗадачи(ЗадачаСсылка)

    ТипЗадачи = Типзнч(ЗадачаСсылка);
	СтруктураДанных = Новый Структура("ЭтоКомпозиция, ОбъектТЗНаименование, ОбъектТЗ", Ложь, "");
	
	Запрос = Новый Запрос;
	
	Если ТипЗадачи = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_ПКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.Ссылка = &Ссылка";
		
		
	ИначеЕсли ТипЗадачи = Тип("ЗадачаСсылка.Задачи_РКД") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_РКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_РКД.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование
		|ИЗ
		|	Задача.Задачи_РКД КАК Задачи_РКД
		|ГДЕ
		|	Задачи_РКД.Ссылка = &Ссылка";

	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		
		Если ЗначениеЗаполнено(СтруктураДанных.ОбъектТЗ) Тогда
			СтруктураДанных.ЭтоКомпозиция = ТипЗнч(СтруктураДанных.ОбъектТЗ) = Тип("СправочникСсылка.Композиции");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат  СтруктураДанных
	
КонецФункции // ПолучитьДанныеЗадачи()
